/* --------------------------------- 数组函数库 -------------------------------------- */
/* ---------------------- 创建人员：龙湘勇 创建时间：2008-11-06 ------------------------- */

/*
 * 判断某字符串是否存在于某字符串数组中
 *
 * 参数1：字符串
 * 参数2：字符串数组
 *
 * 返回：true表存在，false表不存在
 *
 * 编写人员：龙湘勇
 * 编写时间：2006-12-14
 */
function checkIsExist(str,strAarray)
{
    for(var i = 0; i < strAarray.length; i++)
    {
        if(strAarray[i] == str)
        {
            return true;
        }
    }

    return false;
}
